<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# SQL Exam
© ExploreAI Academy

## Instructions to students

This challenge is designed to determine how much you have learned so far and will test your knowledge on SQL.

The answers for this challenge should be selected on Athena for each corresponding multiple-choice question. The questions are included in this notebook and are numbered according to the Athena questions. The options for each question have also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good luck!_**

## Honour code

I, IBRAHIM AMBALE, confirm – by submitting this document – that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## The TMDb database

In this supplementary exam, you will be exploring [The Movie Database](https://www.themoviedb.org/) – an online movie and TV show database that houses some of the most popular movies and TV shows at your fingertips. The TMDb database supports 39 official languages used in over 180 countries daily and dates back all the way to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship Diagram (ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ERD, the TMDb database consists of `12 tables` containing information about movies, cast, genre, and so much more.  

Let's get started!

## Loading the database

Before you begin, you need to prepare your SQL environment.  You can do this by loading the magic command `%load_ext sql`.

In [73]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Next, go ahead and load your database. To do this, you will need to ensure you have downloaded the `TMDB.db` sqlite file from Athena and have stored it in a known location.

In [74]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql sqlite:///TMDB-a-4006.db

'Connected: @TMDB-a-4006.db'

If the above line didn't throw out any errors, then you should be good to go. Good luck with the exam!

## Questions on SQL

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided. Your solution should match one of the multiple-choice questions on Athena.

### Question 1

Who won the Oscar for “Actor in a Leading Role” in  2015?

(Hint: The winner is indicated as '1.0'.)

**Options:** 

  - Micheal Fassbender
  - Natalie Portman
  - Leonardo DiCaprio
  - Eddie Redmayne

In [75]:
%%sql
SELECT
    *
FROM
    oscars
WHERE
    year = 2015
    AND award = "Actor in a Leading Role";

 * sqlite:///TMDB-a-4006.db
Done.

[('2015', 'Actor in a Leading Role', None, 'Bryan Cranston', 'Trumbo'),
 ('2015', 'Actor in a Leading Role', None, 'Matt Damon', 'The Martian'),
 ('2015', 'Actor in a Leading Role', '1.0', 'Leonardo DiCaprio', 'The Revenant'),
 ('2015', 'Actor in a Leading Role', None, 'Michael Fassbender', 'Steve Jobs'),
 ('2015', 'Actor in a Leading Role', None, 'Eddie Redmayne', 'The Danish Girl')]

### Question 2

What query will produce the ten oldest movies in the database?

**Options:**

 - SELECT TOP(10) * FROM movies WHERE release_date ORDER BY release_date ASC

 - SELECT  * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date ASC LIMIT 10

 - SELECT * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date DESC LIMIT 10

 -  SELECT * FROM movies WHERE release_date IS NULL ORDER BY release_date DESC LIMIT 10

In [76]:
%%sql
SELECT 
    * 
FROM 
    movies 
WHERE 
    release_date IS NOT NULL 
    ORDER BY release_date ASC LIMIT 10

 * sqlite:///TMDB-a-4006.db
Done.

[(3059, 'Intolerance', '1916-09-04 00:00:00.000000', 385907, None, 'en', 'Intolerance', 'The story of a poor young woman, separated by prejudice from her husband and baby, is interwoven with tales of intolerance from throughout history.', 3.232447, 8394751.0, 197.0, 'Released', 'The Cruel Hand of Intolerance', 7.4, 60),
 (3060, 'The Big Parade', '1925-11-05 00:00:00.000000', 245000, None, 'en', 'The Big Parade', "The story of an idle rich boy who joins the US Army's Rainbow Division and is sent to France to fight in World War I, becomes friends with two working class men, experiences the horrors of trench warfare, and finds love with a French girl.", 0.785744, 22000000.0, 151.0, 'Released', None, 7.0, 21),
 (19, 'Metropolis', '1927-01-10 00:00:00.000000', 92620000, None, 'de', 'Metropolis', "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.", 32.351527, 650422.0, 153.0, 'Released', 'There can be no understanding between the hands and the brain unless the heart acts as mediator.', 8.0, 657),
 (905, "Pandora's Box", '1929-01-30 00:00:00.000000', 0, None, 'de', 'Die Bnchse der Pandora', 'The rise and inevitable fall of an amoral but naive young woman whose insouciant eroticism inspires lust and violence in those around her.', 1.824184, 0.0, 109.0, 'Released', None, 7.6, 45),
 (65203, 'The Broadway Melody', '1929-02-08 00:00:00.000000', 379000, None, 'en', 'The Broadway Melody', "Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield' ... (195 characters truncated) ... eenie recognizes, that she is for Jock nothing more than a toy, and it also takes a while till Harriet recognizes, that Eddie is in love with Queenie", 0.968865, 4358000.0, 100.0, 'Released', "The pulsating drama of Broadway's bared heart speaks and sings with a voice to stir your soul!", 5.0, 19),
 (22301, "Hell's Angels", '1930-11-15 00:00:00.000000', 3950000, None, 'en', "Hell's Angels", "Two brothers attending Oxford enlist with the Royal Flying Corps when World War I breaks out. Roy and Monte Rutledge have very different personalitie ... (576 characters truncated) ... t a strategic German munitions facility is a booming success, but with a squadron of fighters bearing down on them afterwards, escape seems unlikely.", 8.484123, 8000000.0, 127.0, 'Released', "Howard Hughes' Thrilling Multi-Million Dollar Air Spectacle", 6.1, 19),
 (22649, 'A Farewell to Arms', '1932-12-08 00:00:00.000000', 4, None, 'en', 'A Farewell to Arms', "British nurse Catherine Barkley (Helen Hayes) and American Lieutenant Frederic Henry (Gary Cooper) fall in love during the First World War in Italy.  ... (105 characters truncated) ... the war rages on. Academy Awards winner for Best Cinematography and for Best Sound, Recording. Nominated for Best Picture and for Best Art Direction.", 1.199451, 25.0, 89.0, 'Released', 'Every woman who has loved will understand', 6.2, 28),
 (3062, '42nd Street', '1933-02-02 00:00:00.000000', 439000, None, 'en', '42nd Street', 'A producer puts on what may be his last Broadway show, and at the last moment a chorus girl has to replace the star.', 1.933366, 2281000.0, 89.0, 'Released', None, 6.1, 37),
 (43595, 'She Done Him Wrong', '1933-02-09 00:00:00.000000', 200000, None, 'en', 'She Done Him Wrong', '"New York singer and nightclub owner Lady Lou has more men friends than you can imagine. Unfortunately one of them is a vicious criminal who\'s escap ... (52 characters truncated) ... ing she hasn\'t exactly been faithful in his absence. Help is at hand in the form of young Captain Cummings a local temperance league leader though."', 0.622752, 2200000.0, 66.0, 'Released', "Mae West gives a 'Hot Time' to the nation!", 5.1, 27),
 (3078, 'It Happened One Night', '1934-02-22 00:00:00.000000', 325000, None, 'en', 'It Happened One Night', "Ellie Andrews has just tied the knot with society aviator King Westley when she is whisked away to her father's yacht and out of King's clutches. Ell ... (233 characters truncated) ... ts her back to her husband, or he'll blow the whistle on Ellie to her father. Either way, Peter gets what he wants... a really juicy newspaper story!", 11.871424, 4500000.0, 105.0, 'Released', 'TOGETHER... for the first time', 7.7, 275)]

### Question 3

How many unique awards are there in the Oscars table?

**Options:**
 - 141
 - 53 
 - 80
 - 114

In [77]:
%%sql
SELECT
    COUNT(DISTINCT award)
FROM
    oscars;

 * sqlite:///TMDB-a-4006.db
Done.

[(114,)]

### Question 4

How many movies are there that contain the word “Spider” within their title?

**Options:**
 - 0
 - 5
 - 1
 - 9

In [78]:
%%sql
SELECT
    COUNT(title)
FROM
    movies
WHERE 
    title LIKE "%Spider%";

 * sqlite:///TMDB-a-4006.db
Done.

[(9,)]

### Question 5

How many movies are there that are both in the "Thriller" genre and contain the word “love” anywhere in the keywords?


**Options:**
 - 48
 - 38
 - 14
 - 1

In [79]:
%%sql
WITH Thriller AS (
    SELECT
        movies.title,
        genres.genre_name,
        keywords.keyword_name
    FROM
        movies
    JOIN
        genremap ON movies.movie_id = genremap.movie_id
    JOIN
        genres ON genres.genre_id = genremap.genre_id
    JOIN
        keywordmap ON movies.movie_id = keywordmap.movie_id
    JOIN
        keywords ON keywordmap.keyword_id = keywords.keyword_id
)
SELECT
    COUNT(DISTINCT title)
FROM
    Thriller
WHERE
    genre_name = "Thriller"
    AND keyword_name LIKE "%love%";

 * sqlite:///TMDB-a-4006.db
Done.

[(48,)]

### Question 6

How many movies are there that were released between 1 August 2006 ('2006-08-01') and 1 October 2009 ('2009-10-01') that have a popularity score of more than 40 and a budget of less than 50 000 000?

 
**Options:**

 - 29
 - 23
 - 28
 - 35

In [80]:
%%sql
SELECT
    COUNT(movie_id)
FROM
    movies
WHERE
    release_date BETWEEN '2006-08-01' AND '2009-10-01'
    AND popularity > 40
    AND budget < 50000000;

 * sqlite:///TMDB-a-4006.db
Done.

[(29,)]

### Question 7

How many unique characters has "Vin Diesel" played so far in the database?

**Options:**
 - 24
 - 19
 - 18
 - 16

In [81]:
%%sql
SELECT
    COUNT(actors.actor_id)
FROM
    actors
JOIN
    casts
    ON actors.actor_id = casts.actor_id
WHERE
    actors.actor_name = "Vin Diesel";

 * sqlite:///TMDB-a-4006.db
Done.

[(19,)]

### Question 8

What are the genres of the movie “The Royal Tenenbaums”?


**Options:**
 - Action, Romance
 - Drama, Comedy
 - Crime, Thriller
 - Drama, Romance

In [82]:
%%sql
SELECT
    movies.title,
    genres.genre_name
FROM
    movies
JOIN
    genremap
    ON movies.movie_id = genremap.movie_id
JOIN
    genres
    ON genres.genre_id = genremap.genre_id
WHERE
   movies.title = "The Royal Tenenbaums";

 * sqlite:///TMDB-a-4006.db
Done.

[('The Royal Tenenbaums', 'Drama'), ('The Royal Tenenbaums', 'Comedy')]

### Question 9

What are the three production companies that have the highest movie popularity score on average, as recorded within the database?


**Options:**

 - MCL Films S.A., Turner Pictures, and George Stevens Productions
 - The Donners' Company, Bulletproof Cupid, and Kinberg Genre
 - Bulletproof Cupid, The Donners' Company, and MCL Films S.A
 - B.Sting Entertainment, Illumination Pictures, and Aztec Musique

In [83]:
%%sql
SELECT
    pc.production_company_name,
    movies.popularity,
    AVG(movies.popularity) AS avg_popularity_score
FROM
    movies
JOIN
    productioncompanymap pcm
    ON pcm.movie_id = movies.movie_id
JOIN
    productioncompanies pc
    ON pc.production_company_id = pcm.production_company_id
GROUP BY
    pc.production_company_name
    ORDER BY avg_popularity_score DESC
LIMIT 4;

 * sqlite:///TMDB-a-4006.db
Done.

[("The Donners' Company", 514.569956, 514.569956),
 ('Bulletproof Cupid', 481.098624, 481.098624),
 ('Kinberg Genre', 139.272042, 326.92099900000005),
 ('Illumination Entertainment', 113.858273, 234.9200424)]

### Question 10

How many female actors (i.e. gender = 1) have a name that starts with the letter "N"?


**Options:**

 - 0
 - 355
 - 7335
 - 1949

In [84]:
%%sql
SELECT
    COUNT(gender)
FROM
    actors
WHERE
    gender = 1 AND actor_name LIKE "N%";

 * sqlite:///TMDB-a-4006.db
Done.

[(355,)]

### Question 11

Which genre has, on average, the lowest movie popularity score? 


**Options:**

 - Science Fiction
 - Animation
 - Documentary
 - Foreign

In [85]:
%%sql
SELECT
    genres.genre_name,
    AVG(movies.popularity) AS avg_pop_score
FROM
    movies
JOIN
    genremap
    ON movies.movie_id = genremap.movie_id
JOIN
    genres
    ON genres.genre_id = genremap.genre_id
GROUP BY
    genres.genre_name
ORDER BY
    avg_pop_score;

 * sqlite:///TMDB-a-4006.db
Done.

[('Foreign', 0.686786794117647),
 ('Documentary', 3.945723809090908),
 ('TV Movie', 6.389414749999999),
 ('Music', 13.101512475675676),
 ('Romance', 15.962426457494416),
 ('History', 17.444838720812175),
 ('Drama', 17.764853371789304),
 ('Comedy', 18.221000988966285),
 ('Western', 18.23627854878048),
 ('Horror', 18.295915104046244),
 ('Crime', 22.85327434051726),
 ('War', 23.777288569444423),
 ('Thriller', 24.460076525117703),
 ('Mystery', 24.58682736494254),
 ('Family', 27.832848912280713),
 ('Action', 30.94038215337952),
 ('Fantasy', 36.38704340094338),
 ('Science Fiction', 36.45180587102805),
 ('Animation', 38.81343931196578),
 ('Adventure', 39.26804199113923)]

### Question 12

Which award category has the highest number of actor nominations (actors can be male or female)? (Hint: `Oscars.name` contains both actors' names and film names.)

**Options:**

- Special Achievement Award
- Actor in a Supporting Role
- Actress in a Supporting Role
- Best Picture

In [86]:
%%sql

SELECT
    award,
    COUNT(award) AS award_count
FROM
    oscars
JOIN
    actors
    ON actors.actor_name = oscars.name
GROUP BY
    award
ORDER BY
    award_count DESC
LIMIT 7;

 * sqlite:///TMDB-a-4006.db
Done.

[('Actor in a Supporting Role', 356),
 ('Actress in a Supporting Role', 331),
 ('Actress in a Leading Role', 198),
 ('Actor in a Leading Role', 197),
 ('Actor', 184),
 ('Actress', 145),
 ('Honorary Award', 35)]

### Question 13

For all of the entries in the Oscars table before 1934, the year is stored differently than in all the subsequent years. For example, the year would be saved as “1932/1933” instead of just “1933” (the second indicated year).  Which of the following options would be the appropriate code to update this column to have the format of the year be consistent throughout the entire table (second indicated year only shown)?


**Options:**

- `UPDATE Oscars SET year = RIGHT(year, -4)`
- `UPDATE Oscars SET year = SELECT substr(year, -4)`
- `UPDATE Oscars SET year = substr(year, -4)`
- `UPDATE Oscars year =  substr(year, 4)`

In [87]:
%%sql
UPDATE Oscars SET year = substr(year, -4)

 * sqlite:///TMDB-a-4006.db
9964 rows affected.

ResourceClosedError: This result object does not return rows. It has been closed automatically.

### Question 14

DStv will be having a special week dedicated to the actor Alan Rickman. Which of the following queries would create a new _view_ that shows the titles, release dates, taglines, and overviews of all movies that Alan Rickman has played in?



**Options:**

- SELECT title, release_date, tagline, overview 
FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id 
WHERE Actors.actor_name = 'Alan Rickman'
AS VIEW Alan_Rickman_Movies

- CREATE VIEW Alan_Rickman_Movies AS  
SELECT title, release_date, tagline, overview FROM Movies  
LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors
ON Casts.actor_id = Actors.actor_id
WHERE Actors.actor_name = 'Alan Rickman' 


- CREATE NEW VIEW  Name  = Alan_Rickman_Movies AS SELECT title, release_date, tagline, overview FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

- VIEW Alan_Rickman_Movies AS SELECT title, release_date, tagline, overview FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

In [ ]:
%%sql
CREATE VIEW Alan_Rickman_Movies AS 
    SELECT 
        title, 
        release_date, 
        tagline, 
        overview 
    FROM 
        Movies 
    LEFT JOIN 
        Casts 
        ON Casts.movie_id = Movies.movie_id 
    LEFT JOIN 
        Actors ON Casts.actor_id = Actors.actor_id 
    WHERE 
        Actors.actor_name = 'Alan Rickman';

### Question 15

Which of the statements about database normalisation are true?

**Statements:**
 
i) Database normalisation improves data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

ii) Database normalisation supports up to the Third Normal Form and removes all data anomalies.

iii) Database normalisation removes inconsistencies that may cause the analysis of our data to be more complicated.

iv) Database normalisation increases data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

**Options:**

 - (i) and (ii)
 - (i) and (iii)
 - (ii) and (iv)
 - (iii) and (iv)

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>